SoCXin/CH32V307/src/EXAM/USB/USBFS/HOST/User/ch32vf30x_usbotg_host.h
#define R8_UDEV_CTRL        (*((PUINT8V)(0x40023401)))  // USB device physical prot control
#define     RB_UD_PD_DIS        0x80      // disable USB UDP/UDM pulldown resistance: 0=enable pulldown, 1=disable
#define     RB_UD_DP_PIN        0x20      // ReadOnly: indicate current UDP pin level
#define     RB_UD_DM_PIN        0x10      // ReadOnly: indicate current UDM pin level
#define     RB_UD_LOW_SPEED     0x04      // enable USB physical port low speed: 0=full speed, 1=low speed
#define     RB_UD_GP_BIT        0x02      // general purpose bit
#define     RB_UD_PORT_EN       0x01      // enable USB physical port I/O: 0=disable, 1=enable

#define R8_UHOST_CTRL       R8_UDEV_CTRL                // USB host physical prot control
#define     RB_UH_PD_DIS        0x80      // disable USB UDP/UDM pulldown resistance: 0=enable pulldown, 1=disable
#define     RB_UH_DP_PIN        0x20      // ReadOnly: indicate current UDP pin level
#define     RB_UH_DM_PIN        0x10      // ReadOnly: indicate current UDM pin level
#define     RB_UH_LOW_SPEED     0x04      // enable USB port low speed: 0=full speed, 1=low speed
#define     RB_UH_BUS_RESET     0x02      // control USB bus reset: 0=normal, 1=force bus reset
#define     RB_UH_PORT_EN       0x01      // enable USB port: 0=disable, 1=enable port, automatic disabled if USB device detached

#define R8_USB_INT_EN       (*((PUINT8V)(0x40023402)))  // USB interrupt enable
#define     RB_UIE_DEV_SOF      0x80      // enable interrupt for SOF received for USB device mode
#define     RB_UIE_DEV_NAK      0x40      // enable interrupt for NAK responded for USB device mode
#define     RB_UIE_FIFO_OV      0x10      // enable interrupt for FIFO overflow
#define     RB_UIE_HST_SOF      0x08      // enable interrupt for host SOF timer action for USB host mode
#define     RB_UIE_SUSPEND      0x04      // enable interrupt for USB suspend or resume event
#define     RB_UIE_TRANSFER     0x02      // enable interrupt for USB transfer completion
#define     RB_UIE_DETECT       0x01      // enable interrupt for USB device detected event for USB host mode
#define     RB_UIE_BUS_RST      0x01      // enable interrupt for USB bus reset event for USB device mode

#define R8_USB_DEV_AD       (*((PUINT8V)(0x40023403)))  // USB device address
#define     RB_UDA_GP_BIT       0x80      // general purpose bit
#define     MASK_USB_ADDR       0x7F      // bit mask for USB device address

#define R32_USB_STATUS      (*((PUINT32V)(0x40023404))) // USB miscellaneous status & interrupt flag & interrupt status
#define R8_USB_MIS_ST       (*((PUINT8V)(0x40023405)))  // USB miscellaneous status
#define     RB_UMS_SOF_PRES     0x80      // RO, indicate host SOF timer presage status
#define     RB_UMS_SOF_ACT      0x40      // RO, indicate host SOF timer action status for USB host
#define     RB_UMS_SIE_FREE     0x20      // RO, indicate USB SIE free status
#define     RB_UMS_R_FIFO_RDY   0x10      // RO, indicate USB receiving FIFO ready status (not empty)
#define     RB_UMS_BUS_RESET    0x08      // RO, indicate USB bus reset status
#define     RB_UMS_SUSPEND      0x04      // RO, indicate USB suspend status
#define     RB_UMS_DM_LEVEL     0x02      // RO, indicate UDM level saved at device attached to USB host
#define     RB_UMS_DEV_ATTACH   0x01      // RO, indicate device attached status on USB host

#define R8_USB_INT_FG       (*((PUINT8V)(0x40023406)))  // USB interrupt flag
#define     RB_U_IS_NAK             0x80    // RO, indicate current USB transfer is NAK received
#define     RB_U_TOG_OK             0x40    // RO, indicate current USB transfer toggle is OK
#define     RB_U_SIE_FREE         0x20  // RO, indicate USB SIE free status
#define     RB_UIF_FIFO_OV        0x10  // FIFO overflow interrupt flag for USB, direct bit address clear or write 1 to clear
#define     RB_UIF_HST_SOF        0x08  // host SOF timer interrupt flag for USB host, direct bit address clear or write 1 to clear
#define     RB_UIF_SUSPEND        0x04  // USB suspend or resume event interrupt flag, direct bit address clear or write 1 to clear
#define     RB_UIF_TRANSFER       0x02  // USB transfer completion interrupt flag, direct bit address clear or write 1 to clear
#define     RB_UIF_DETECT           0x01    // device detected event interrupt flag for USB host mode, direct bit address clear or write 1 to clear
#define     RB_UIF_BUS_RST        0x01  // bus reset event interrupt flag for USB device mode, direct bit address clear or write 1 to clear

#define R8_USB_INT_ST       (*((PUINT8V)(0x40023407)))  // USB interrupt status
#define     RB_UIS_IS_NAK       0x80      // RO, indicate current USB transfer is NAK received for USB device mode
#define     RB_UIS_TOG_OK       0x40      // RO, indicate current USB transfer toggle is OK
#define     RB_UIS_TOKEN1       0x20      // RO, current token PID code bit 1 received for USB device mode
#define     RB_UIS_TOKEN0       0x10      // RO, current token PID code bit 0 received for USB device mode
#define     MASK_UIS_TOKEN      0x30      // RO, bit mask of current token PID code received for USB device mode
#define     UIS_TOKEN_OUT       0x00
#define     UIS_TOKEN_SOF       0x10
#define     UIS_TOKEN_IN        0x20
#define     UIS_TOKEN_SETUP     0x30
// bUIS_TOKEN1 & bUIS_TOKEN0: current token PID code received for USB device mode
//   00: OUT token PID received
//   01: SOF token PID received
//   10: IN token PID received
//   11: SETUP token PID received
#define     MASK_UIS_ENDP       0x0F      // RO, bit mask of current transfer endpoint number for USB device mode
#define     MASK_UIS_H_RES      0x0F      // RO, bit mask of current transfer handshake response for USB host mode: 0000=no response, time out from device, others=handshake response PID received

#define R8_USB_RX_LEN       (*((PUINT8V)(0x40023408)))  // USB receiving length
#define R32_USB_BUF_MODE    (*((PUINT32V)(0x4002340c))) // USB endpoint buffer mode
#define R8_UEP4_1_MOD       (*((PUINT8V)(0x4002340c)))  // endpoint 4/1 mode
#define     RB_UEP1_RX_EN       0x80      // enable USB endpoint 1 receiving (OUT)
#define     RB_UEP1_TX_EN       0x40      // enable USB endpoint 1 transmittal (IN)
#define     RB_UEP1_BUF_MOD     0x10      // buffer mode of USB endpoint 1
// bUEPn_RX_EN & bUEPn_TX_EN & bUEPn_BUF_MOD: USB endpoint 1/2/3 buffer mode, buffer start address is UEPn_DMA
//   0 0 x:  disable endpoint and disable buffer
//   1 0 0:  64 bytes buffer for receiving (OUT endpoint)
//   1 0 1:  dual 64 bytes buffer by toggle bit bUEP_R_TOG selection for receiving (OUT endpoint), total=128bytes
//   0 1 0:  64 bytes buffer for transmittal (IN endpoint)
//   0 1 1:  dual 64 bytes buffer by toggle bit bUEP_T_TOG selection for transmittal (IN endpoint), total=128bytes
//   1 1 0:  64 bytes buffer for receiving (OUT endpoint) + 64 bytes buffer for transmittal (IN endpoint), total=128bytes
//   1 1 1:  dual 64 bytes buffer by bUEP_R_TOG selection for receiving (OUT endpoint) + dual 64 bytes buffer by bUEP_T_TOG selection for transmittal (IN endpoint), total=256bytes
#define     RB_UEP4_RX_EN       0x08      // enable USB endpoint 4 receiving (OUT)
#define     RB_UEP4_TX_EN       0x04      // enable USB endpoint 4 transmittal (IN)
// bUEP4_RX_EN & bUEP4_TX_EN: USB endpoint 4 buffer mode, buffer start address is UEP0_DMA
//   0 0:  single 64 bytes buffer for endpoint 0 receiving & transmittal (OUT & IN endpoint)
//   1 0:  single 64 bytes buffer for endpoint 0 receiving & transmittal (OUT & IN endpoint) + 64 bytes buffer for endpoint 4 receiving (OUT endpoint), total=128bytes
//   0 1:  single 64 bytes buffer for endpoint 0 receiving & transmittal (OUT & IN endpoint) + 64 bytes buffer for endpoint 4 transmittal (IN endpoint), total=128bytes
//   1 1:  single 64 bytes buffer for endpoint 0 receiving & transmittal (OUT & IN endpoint)
//           + 64 bytes buffer for endpoint 4 receiving (OUT endpoint) + 64 bytes buffer for endpoint 4 transmittal (IN endpoint), total=192bytes

